# Highest Paid Executives Data Analysis Demo

##### Install and Import any dependencies needed

In [10]:
import pandas as pd

##### Read in a dataset (table) with pandas

In [21]:
executives = pd.read_excel ('Men v. Women list of highest-paid executives  copy.xlsx')

##### Call the dataframe (to view the content) -- demo head() and tail() too

In [22]:
executives.head()

,Names (Men),Company,Title,Salary,Unnamed: 4,Names (Women),Company,Title.1,Salary.1,Unnamed: 9,Differency in Pay
0,Marc Lore,Walmart,"CEO, U.S. E-Commerce",243876539.0,NaN,Safra Catz,Oracle,CEO,40729965.0,NaN,203146574
1,Sundar Pichai,Google,CEO,199718200.0,NaN,Ruth Porat,Alphabet,CFO,39074129.0,NaN,160644071
2,Thomas Rutledge,Charter Communications,CEO,98012344.0,NaN,Meg Whitman,Hewlett Packard Enterprise,CEO,32935138.0,NaN,65077206
3,John Weinberg,Evercore,Executive Chairman,83312974.0,NaN,Ginni Rometty,IBM,CEO,32307434.0,NaN,51005540
4,Leslie Moonves,CBS,CEO,68594646.0,NaN,Marissa Mayer,Yahoo,CEO,27410159.0,NaN,41184487

In [23]:
executives.tail()

,Names (Men),Company,Title,Salary,Unnamed: 4,Names (Women),Company,Title.1,Salary.1,Unnamed: 9,Differency in Pay
12,Thomas Kurian,Oracle,"President, Product",35760008.0,NaN,Gillian Tans,Booking.com,CEO,17103279.0,NaN,18656729
13,Andrew Jassy,Amazon,"CEO, Web Services",35609644.0,NaN,Irene Rosenfeld,Mondelez International,CEO,15840326.0,NaN,19769318
14,Jon Feltheimer,Lions Gate Entertainment,CEO,35336616.0,NaN,Jane Elfers,Childrens Place,CEO,15691170.0,NaN,19645446
15,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0
16,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0

##### Run a few descriptive statistics on the dataframe -- Get the number of columns and rows -- demo shape and info()

In [24]:
executives.shape

(17, 11)

In [25]:
executives.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 11 columns):
Names (Men)          15 non-null object
Company              15 non-null object
Title                15 non-null object
Salary               15 non-null float64
Unnamed: 4           0 non-null float64
Names (Women)        15 non-null object
Company              15 non-null object
Title.1              15 non-null object
Salary.1             15 non-null float64
Unnamed: 9           0 non-null float64
Differency in Pay    17 non-null int64
dtypes: float64(4), int64(1), object(6)
memory usage: 1.5+ KB

##### Try using the describe method on the dataframe

In [26]:
executives.describe()

             Salary  Unnamed: 4      Salary.1  Unnamed: 9  Differency in Pay
count  1.500000e+01         0.0  1.500000e+01         0.0       1.700000e+01
mean   7.380501e+07         NaN  2.500919e+07         NaN       4.305514e+07
std    6.358209e+07         NaN  8.022632e+06         NaN       5.524120e+07
min    3.533662e+07         NaN  1.569117e+07         NaN       0.000000e+00
25%    3.735137e+07         NaN  1.891106e+07         NaN       1.858834e+07
50%    4.127221e+07         NaN  2.290289e+07         NaN       1.964545e+07
75%    7.595381e+07         NaN  2.985880e+07         NaN       4.118449e+07
max    2.438765e+08         NaN  4.072996e+07         NaN       2.031466e+08

##### drop any values that are not important in the dataframe -- drop(columns = []) AND drop(index = [])

In [105]:
#executives.drop(columns=['Unnamed; 4', 'Unnamed; 9'], inplace = True)

In [56]:
#executive.head()

In [57]:
#executives

In [103]:
#executives = executives.drop(index=[15,16])

##### Check your work -- call the dataframe

In [54]:
#executives.sort_values('Difference in Pay', ascending = False)

##### sort the dataframe by the 'Difference in Pay' column

##### Create two new dataframes - one for male executives and one for female executives

In [49]:
#Start with building a new dataframe called Female_executives

In [85]:
pd.DataFrame(data = executives, columns = ['Names (Women)','Company', 'Title'])

      Names (Women)                     Company                 Title
0        Safra Catz                      Oracle  CEO, U.S. E-Commerce
1        Ruth Porat                   Alphabet                    CEO
2       Meg Whitman  Hewlett Packard Enterprise                   CEO
3     Ginni Rometty                         IBM    Executive Chairman
4     Marissa Mayer                       Yahoo                   CEO
5       Indra Nooyi                     Pepsico    Executive Chairman
6   Sheryl Sandberg                    Facebook                   COO
7   Angela Ahrendts                       Apple                   CTO
8        Mary Barra              General Motors                   CEO
9   Phebe Novakovic            General Dynamics                   CEO
10  Marillyn Hewson             Lockheed Martin                   CEO
11      Mary Erdoes              JPMorgan Chase                   CEO
12     Gillian Tans                 Booking.com    President, Product
13  Irene Rosenfeld      Mondelez International     CEO, Web Services
14      Jane Elfers             Childrens Place                   CEO
15              NaN                         NaN                   NaN
16              NaN                         NaN                   NaN

In [86]:
#Call Female_executives

In [108]:
female_executives = pd.DataFrame(data = executives, columns = ['Names (Women)','Company', 'Title'])

In [72]:
#Build another dataframe called Male_executives

In [89]:
pd.DataFrame(data = executives, columns = ['Names (Men)','Company', 'Title'])

         Names (Men)                     Company                 Title
0          Marc Lore                      Oracle  CEO, U.S. E-Commerce
1      Sundar Pichai                   Alphabet                    CEO
2    Thomas Rutledge  Hewlett Packard Enterprise                   CEO
3      John Weinberg                         IBM    Executive Chairman
4     Leslie Moonves                       Yahoo                   CEO
5   Dean Metropoulos                     Pepsico    Executive Chairman
6       John Bickham                    Facebook                   COO
7   Lawrence Ellison                       Apple                   CTO
8           Bob Iger              General Motors                   CEO
9          Mark Hurd            General Dynamics                   CEO
10     Stephen Burke             Lockheed Martin                   CEO
11      David Zaslav              JPMorgan Chase                   CEO
12     Thomas Kurian                 Booking.com    President, Product
13      Andrew Jassy      Mondelez International     CEO, Web Services
14    Jon Feltheimer             Childrens Place                   CEO
15               NaN                         NaN                   NaN
16               NaN                         NaN                   NaN

In [73]:
#Call Male_executives

In [99]:
male_executives = pd.DataFrame(data = executives, columns = ['Names(Men)','Company', 'Title'])

In [100]:
##### Run the describe method on each of the new dataframes

In [75]:
male_executives.describe()

             Names (Men)   Company Title
count                 15        15    15
unique                15        15     7
top     Dean Metropoulos  Facebook   CEO
freq                   1         1     8

##### sort Female_executives and Male_executives dataframes by lowest to highest salary figures

In [113]:
#Sort Female_executives using sort_values()

In [111]:
#female_executives.sort_values('salary.1', ascending = False)

In [114]:
#Call Female_executives

In [117]:
#Sort Male_executives using sort_values()

In [ ]:
male_executives.sort_values('Salary.1', ascending = False)

In [116]:
#Call Male_executives

##### Create variables for the male and female executives with the highest salary

In [96]:
#highest_male = Male_executives['Salary'][0]

In [ ]:
#highest_female = Female_executives['Salary.1',][0]

##### Find the difference between the highest male and female salaries

In [98]:
Difference = Highest_male - Highest_female

NameError: name 'Highest_male' is not defined

##### Use the describe method on Male_executives with respect to companies

In [100]:
male_executives['Company'].describe()

count           15
unique          15
top       Facebook
freq             1
Name: Company, dtype: object

##### Use boolean indexing to find the executives that work at Oracle

In [70]:
#Which male executives work for Oracle?

In [106]:
male_executives[male_executives['Company'] == 'Oracle' ]

   Names(Men) Company                 Title
0         NaN  Oracle  CEO, U.S. E-Commerce

In [69]:
#How many female executives work at Oracle?

In [107]:
female_executives[female_executives['Company'] == 'Oracle' ]

NameError: name 'female_executives' is not defined

##### Are there any other companies that stand-out by appearing more than once?

In [76]:
# Use value_counts() to list distinct company names for Male_executives

In [77]:
# Use value_counts() to list distinct company names for Female_executives